# SQL Exercises, Practice, Solution - BASIC exercises on movie Database

SQL [10 exercises with solution]

Sample Database description:

The sample database represents some of the data storage and retrieval about a movie related industry. Most of the people loves to watch movie, and for all of them we are providing a sample information about the movie related questions coming to their mind. This design of database will make it easier to the movie lovers to know the curiocities about the movies.

List of tables in the movie database:

actor
genres
director
movie
movie_genres
movie_direction
reviewer
rating
movie_cast

In [1]:
#1. From the following table, write a SQL query to find the name and year of the movies. Return movie title, movie release year.

select mov_title, mov_dt_rel from movie;

In [2]:
#2. From the following table, write a SQL query to find when the movie 'American Beauty' released. Return movie release year.

select  mov_year from movie where mov_title ='American Beauty';

In [3]:
#3. From the following table, write a SQL query to find the movie that was released in 1999. Return movie title.

select  mov_title from movie where mov_year = 1999;

In [4]:
#4 From the following table, write a SQL query to find those movies, which were released before 1998. Return movie title.

select  mov_title from movie where mov_year < 1998;

In [5]:
#5. From the following tables, write a SQL query to find the name of all reviewers and movies together in a single list.

select  reviewer.rev_name from reviewer union 
(select movie.mov_title from movie);

In [6]:
#6. From the following table, write a SQL query to find all reviewers who have rated seven or more stars to their rating. Return reviewer name.

select  re.rev_name from reviewer re  join
rating ra on ra.rev_id=re.rev_id
where ra.rev_stars >= 7;

In [7]:
#7. From the following tables, write a SQL query to find the movies without any rating. Return movie title.

select  mov_title from movie 
where mov_id not in (select mov_id from rating);

In [8]:
#8. From the following table, write a SQL query to find the movies with ID 905 or 907 or 917. Return movie title.

select  mov_title from movie 
where mov_id in (905,907,917);

In [9]:
#9. From the following table, write a SQL query to find the movie titles that contain the word 'Boogie Nights'. Sort the result-set in ascending order by movie year. Return movie ID, movie title and movie release year.

select  mov_id,mov_title,mov_dt_rel,mov_year from movie where mov_title like '%Boogie Nights%' 
order by mov_year;

In [ ]:
#10. From the following table, write a SQL query to find those actors with the first name 'Woody' and the last name 'Allen'. Return actor ID.

select act_id from actor where act_fname ='Woody' and act_lname ='Allen';

Exercise URL: https://www.w3resource.com/sql-exercises/movie-database-exercise/basic-exercises-on-movie-database.php#SQLEDITOR

# Subqueries

In [ ]:
#1. From the following table, write a SQL query to find the actors who played a role in the movie 'Annie Hall'. Return all the fields of actor table.

select * from actor 
where act_id IN
(select act_id from movie_cast
where mov_id IN

(select mov_id from movie where mov_title ='Annie Hall'));

In [1]:
#2. From the following tables, write a SQL query to find the director of a film that cast a role in 'Eyes Wide Shut'. Return director first name, last name.

select dir_fname , dir_lname from director
where dir_id IN
(select dir_id from movie_direction
where mov_id IN
(select mov_id from movie_cast
where mov_id IN
(select mov_id from movie 
where mov_title ='Eyes Wide Shut')));

In [ ]:
#3. From the following table, write a SQL query to find those movies that have been released in countries other than the United Kingdom. Return movie title, movie year, movie time, and date of release, releasing country.

select mov_title ,mov_year, mov_time, mov_dt_rel, mov_rel_country from movie
where mov_rel_country !='UK';

In [2]:
#4. From the following tables, write a SQL query to find for movies whose reviewer is unknown. Return movie title, year, release date, director first name, last name, actor first name, last name.

In [ ]:
select mov_title,mov_year,mov_time,mov_dt_rel,dir_fname,dir_lname,act_fname,
act_lname from movie a, movie_direction b, director c, 
rating d, reviewer e, actor f, movie_cast g 
where a.mov_id=b.mov_id and
b.dir_id=c.dir_id and
a.mov_id=d.mov_id and
e.rev_id=d.rev_id and
a.mov_id=g.mov_id and

g.act_id=f.act_id and

e.rev_name IS NULL;

In [1]:
#5. From the following tables, write a SQL query to find those movies directed by the director whose first name is Woddy and last name is Allen. Return movie title.

select mov_title from movie 
where mov_id = (select mov_id from movie_direction
where dir_id = (select dir_id from director
where dir_fname= 'Woody' and dir_lname='Allen'));

In [2]:
#6. From the following tables, write a SQL query to determine those years in which there was at least one movie that received a rating of at least three stars. Sort the result-set in ascending order by movie year. Return movie year.

select distinct mov_year from movie where
mov_id IN (select mov_id from rating where  rev_stars >=3) order by mov_year;

In [3]:
#7. From the following table, write a SQL query to search for movies that do not have any ratings. Return movie title.

select distinct mov_title from movie where mov_id IN
(select mov_id from movie 
where mov_id NOT IN(select mov_id from rating));

In [4]:
#8. From the following table, write a SQL query to find those reviewers who have not given a rating to certain films. Return reviewer name.

select distinct rev_name from reviewer where rev_id IN
(select rev_id from rating where rev_stars IS NULL);

In [5]:
#9. From the following tables, write a SQL query to find movies that have been reviewed by a reviewer and received a rating. Sort the result-set in ascending order by reviewer name, movie title, review Stars. Return reviewer name, movie title, review Stars.

select rev_name,mov_title,rev_stars from movie m ,reviewer r ,rating rs
where r.rev_id =rs.rev_id 
and m.mov_id=rs.mov_id
and rs.rev_stars IS NOT NULL
and r.rev_name IS NOT NULL
order by rev_name,mov_title,rev_stars;

In [6]:
#10. From the following table, write a SQL query to find movies that have been reviewed by a reviewer and received a rating. Group the result set on reviewer’s name, movie title. Return reviewer’s name, movie title.

select rev_name,mov_title from movie m , reviewer r,rating r2 where
r.rev_id=r2.rev_id and
r2.mov_id=m.mov_id and
r2.rev_stars IS NOT NULL and
r.rev_name IS NOT NULL
group by r.rev_name,m.mov_title ;

In [7]:
#11. From the following tables, write a SQL query to find those movies, which have received highest number of stars. Group the result set on movie title and sorts the result-set in ascending order by movie title. Return movie title and maximum number of review stars.

 select mov_title,max(rev_stars) from movie,rating where 
movie.mov_id =rating.mov_id
and rating.rev_stars is not null
group by mov_title
order by mov_title;

In [8]:
#12. From the following tables, write a SQL query to find all reviewers who rated the movie 'American Beauty'. Return reviewer name.

select rev_name from reviewer where 
rev_id IN (select rev_id from reviewer
where rev_id IN (select rev_id from rating
where mov_id IN (select mov_id from movie
where mov_title ='American Beauty')));

In [9]:
#13. From the following table, write a SQL query to find the movies that have not been reviewed by any reviewer body other than 'Paul Monks'. Return movie title.

select mov_title from movie where mov_id IN
(select mov_id from rating
where rev_id NOT IN(select rev_id from reviewer where 
rev_name='Paul Monks'));

In [1]:
#14. From the following table, write a SQL query to find the movies with the lowest ratings. Return reviewer name, movie title, and number of stars for those movies.

select r.rev_name,m.mov_title,r2.rev_stars from reviewer r, movie m , rating r2 
where r2.rev_stars in(select min(r2.rev_stars) from rating r2)
and r2.mov_id=m.mov_id
and r.rev_id =r2.rev_id;

In [2]:
#15. From the following tables, write a SQL query to find the movies directed by 'James Cameron'. Return movie title.

select mov_title from movie where 
mov_id in (select mov_id from movie_direction 
where dir_id in(select dir_id from director where
 dir_fname='James' and dir_lname='Cameron'));

In [4]:
#16. Write a query in SQL to find the movies in which one or more actors appeared in more than one film.

select mov_title from movie 
where mov_id in (select mov_id from movie_cast
where act_id in(select act_id from actor
where act_id in(select act_id from movie_cast
group by act_id having count(act_id)>1)));

# JOINS

In [5]:
#1. From the following table, write a SQL query to find all reviewers whose ratings contain a NULL value. Return reviewer name.

select rev_name from reviewer  join rating  
on rating.rev_id =reviewer.rev_id 
where rev_stars IS NULL;

In [1]:
#2. From the following table, write a SQL query to find out who was cast in the movie 'Annie Hall'. Return actor first name, last name and role.

select act_fname,act_lname,role from movie_cast 
join actor  on movie_cast.act_id=actor.act_id
join movie  on movie_cast.mov_id=movie.mov_id
where mov_title='Annie Hall';

In [3]:
#3. From the following table, write a SQL query to find the director who directed a movie that featured a role in 'Eyes Wide Shut'. Return director first name, last name and movie title.

select dir_fname,dir_lname,mov_title from director
join movie_direction on director.dir_id=movie_direction.dir_id
join movie_cast on  movie_direction.mov_id=movie_cast.mov_id
join movie on movie_cast.mov_id=movie.mov_id
where mov_title='Eyes Wide Shut';

In [4]:
#4. From the following tables, write a SQL query to find the director of a movie that cast a role as Sean Maguire. Return director first name, last name and movie title.

select dir_fname,dir_lname,mov_title from director
join movie_direction on director.dir_id=movie_direction.dir_id
join movie_cast on movie_direction.mov_id=movie_cast.mov_id
join movie on movie_cast.mov_id=movie.mov_id
where role='Sean Maguire';

In [5]:
#5. From the following table, write a SQL query to find out which actors have not appeared in any movies between 1990 and 2000 (Begin and end values are included.). Return actor first name, last name, movie title and release year.

select act_fname,act_lname,mov_title,mov_year,mov_dt_rel from actor
join movie_cast on actor.act_id=movie_cast.act_id 
join movie on movie_cast.mov_id=movie.mov_id
where mov_year not between 1990 and 2000;

In [6]:
#6. From the following table, write a SQL query to find the directors who have directed films in a variety of genres. Group the result set on director first name, last name and generic title. Sort the result-set in ascending order by director first name and last name. Return director first name, last name and number of genres movies.

select dir_fname,dir_lname,gen_title,count(gen_title) from director
join movie_direction on director.dir_id=movie_direction.dir_id
join movie_genres on movie_direction.mov_id= movie_genres.mov_id
join genres on movie_genres.gen_id=genres.gen_id
group by dir_fname,dir_lname,gen_title
order by  dir_fname,dir_lname;

In [7]:
#7. From the following table, write a SQL query to find the movies with year and genres. Return movie title, movie year and generic title.

SELECT mov_title, mov_year, gen_title
FROM movie
NATURAL JOIN movie_genres
NATURAL JOIN genres;

In [3]:
#8. From the following tables, write a SQL query to find all the movies with year, genres, and name of the director.

select mov_title,mov_year,gen_title,dir_fname,dir_lname from movie 
natural join genres
natural join movie_genres
natural join director
natural join movie_direction;

In [ ]:
#9. From the following tables, write a SQL query to find the movies released before 1st January 1989. Sort the result-set in descending order by date of release. Return movie title, release year, date of release, duration, and first and last name of the director.

select mov_title,mov_year,mov_dt_rel,mov_time,dir_fname,dir_lname
from movie join movie_direction on movie.mov_id = movie_direction.mov_id
join director on movie_direction.dir_id=director.dir_id
where mov_dt_rel < '01/01/1989'
order by mov_dt_rel desc;

In [4]:
#10. From the following table, write a SQL query to calculate the average movie length and count the number of movies in each genre. Return genre title, average time and number of movies for each genre.

select gen_title,avg(mov_time),count(gen_title) from movie 
join movie_genres on movie.mov_id =movie_genres.mov_id
join genres on movie_genres.gen_id = genres.gen_id 
group by gen_title;

In [ ]:
#11. From the following table, write a SQL query to find movies with the shortest duration. Return movie title, movie year, director first name, last name, actor first name, last name and role.

select mov_title,mov_year,dir_fname,dir_lname,act_fname,act_lname,role from actor join movie_cast on actor.act_id=movie_cast.act_id join movie on 
movie_cast.mov_id=movie.mov_id join movie_direction on movie.mov_id=movie_direction.mov_id join director on movie_direction.dir_id=
director.dir_id
where mov_time =(select min(mov_time) from movie ) ;

In [5]:
#12. From the following table, write a SQL query to find the years in which a movie received a rating of 3 or 4. Sort the result in increasing order on movie year.

select distinct mov_year from movie join rating on 
movie.mov_id =rating.mov_id 
where rev_stars in (3,4)

order by mov_year;

In [ ]:
#13.From the following tables, write a SQL query to get the reviewer name, movie title, and stars in an order that reviewer name will come first, then by movie title, and lastly by number of stars.

select rev_name,mov_title,rev_stars from movie join rating on 
movie.mov_id =rating.mov_id join reviewer on rating.rev_id=reviewer.rev_id
where rev_name is not null
order by rev_name,mov_title,rev_stars;

In [6]:
#14. From the following table, write a SQL query to find those movies that have at least one rating and received the most stars. Sort the result-set on movie title. Return movie title and maximum review stars.

select mov_title ,max(rev_stars)from movie join rating on 
movie.mov_id=rating.mov_id 
group by mov_title
having max(rev_stars)>0
order by mov_title;

In [7]:
#15. From the following table, write a SQL query to find out which movies have received ratings. Return movie title, director first name, director last name and review stars.

select mov_title ,dir_fname,dir_lname,rev_stars from movie join 
rating on movie.mov_id=rating.mov_id join movie_direction on 
rating.mov_id=movie_direction.mov_id join director on 
movie_direction.dir_id=director.dir_id
where rev_stars is not null;

In [8]:
#16. From the following table, write a SQL query to find movies in which one or more actors have acted in more than one film. Return movie title, actor first and last name, and the role.

select mov_title ,act_fname,act_lname,role from movie join movie_cast on 
movie.mov_id=movie_cast.mov_id join actor on movie_cast.act_id =actor.act_id
where actor.act_id in (select act_id from movie_cast group by act_id having count(*)>=2);

In [ ]:
#17. From the following tables, write a SQL query to find the actor whose first name is 'Claire' and last name is 'Danes'. Return director first name, last name, movie title, actor first name and last name, role.

select dir_fname,dir_lname,mov_title,act_fname,act_lname,role from director
join movie_direction on director.dir_id=movie_direction.dir_id join movie on 
movie_direction.mov_id=movie.mov_id join movie_cast on movie.mov_id =movie_cast.mov_id join actor on actor.act_id =movie_cast.act_id 
where act_fname='Claire' and act_lname='Danes';

In [2]:
#18. From the following table, write a SQL query to find for actors whose films have been directed by them. Return actor first name, last name, movie title and role.

select act_fname,act_lname,mov_title,role from  director join movie_direction on 
director.dir_id=movie_direction.dir_id join movie on movie.mov_id=movie_direction.mov_id join  movie_cast on movie.mov_id=movie_cast.mov_id join actor on actor.act_id=movie_cast.act_id
where act_fname=dir_fname and act_lname=dir_lname;

In [9]:
#19. From the following tables, write a SQL query to find the cast list of the movie ‘Chinatown’. Return first name, last name.

select act_fname,act_lname from movie join movie_cast on 
movie.mov_id=movie_cast.mov_id join actor on movie_cast.act_id =actor.act_id
where mov_title='Chinatown';

In [1]:
#20. From the following tables, write a SQL query to find those movies where actor’s first name is 'Harrison' and last name is 'Ford'. Return movie title.

select mov_title from movie join movie_cast on movie.mov_id =movie_cast.mov_id
join actor on actor.act_id = movie_cast.act_id
where act_fname='Harrison' and act_lname='Ford';

In [3]:
#21. From the following tables, write a SQL query to find the highest-rated movies. Return movie title, movie year, review stars and releasing country.

select mov_title,mov_year,rev_stars,mov_rel_country from movie join rating on 
movie.mov_id=rating.mov_id 
where rev_stars=(select max(rev_stars) from rating);

In [4]:
#22. From the following tables, write a SQL query to find the highest-rated ‘Mystery Movies’. Return the title, year, and rating.

select mov_title,mov_year,rev_stars from movie join rating on 
movie.mov_id=rating.mov_id join movie_genres on rating.mov_id=movie_genres.mov_id
join genres on movie_genres.gen_id=genres.gen_id
where gen_title='Mystery';

In [5]:
#23. From the following tables, write a SQL query to find the years when most of the ‘Mystery Movies’ produced. Count the number of generic title and compute their average rating. Group the result set on movie release year, generic title. Return movie year, generic title, number of generic title and average rating.

select mov_year,gen_title,count(gen_title),avg(rev_stars)from movie join rating 
on movie.mov_id=rating.mov_id join movie_genres on rating.mov_id=movie_genres.mov_id join genres on movie_genres.gen_id=genres.gen_id
where gen_title='Mystery'
group by mov_year,gen_title;

In [6]:
#24. From the following tables, write a query in SQL to generate a report, which contain the fields movie title, name of the female actor, year of the movie, role, movie genres, the director, date of release, and rating of that movie.

select mov_title, act_fname, act_lname, 
mov_year, role, gen_title, dir_fname, dir_lname, 
mov_dt_rel, rev_stars
FROM movie 
natural join movie_cast
natural join actor
natural join movie_genres
natural join genres
natural join movie_direction
natural join director
natural join rating
WHERE act_gender='F';